MateuszTarka00/LIFTSYSTEM_STM32G0_CALLBOX/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "cmsis_os2.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUZZER_OUT_Pin GPIO_PIN_9
#define BUZZER_OUT_GPIO_Port GPIOB
#define LED_UP_Pin GPIO_PIN_1
#define LED_UP_GPIO_Port GPIOA
#define BUTTON_UP_Pin GPIO_PIN_10
#define BUTTON_UP_GPIO_Port GPIOE
#define BUTTON_UP_EXTI_IRQn EXTI4_15_IRQn
#define BUTTON_DOWN_Pin GPIO_PIN_11
#define BUTTON_DOWN_GPIO_Port GPIOE
#define BUTTON_DOWN_EXTI_IRQn EXTI4_15_IRQn
#define PROGRAM_FLOOR_JMP_Pin GPIO_PIN_13
#define PROGRAM_FLOOR_JMP_GPIO_Port GPIOE
#define CAN_OK_Pin GPIO_PIN_2
#define CAN_OK_GPIO_Port GPIOE
#define CAN_FAULT_Pin GPIO_PIN_3
#define CAN_FAULT_GPIO_Port GPIOE
#define LED_DOWN_Pin GPIO_PIN_8
#define LED_DOWN_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
typedef enum
{
	true,
	false
}bool;

extern osThreadId_t ButtonsTaskTHandle;
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
